-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- ホスト: localhost
-- 生成日時: 2021 年 6 月 04 日 01:42
-- サーバのバージョン： 10.4.19-MariaDB
-- PHP のバージョン: 8.0.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- データベース: `gsacf_l05_14`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `participant_table`
--

CREATE TABLE `participant_table` (
  `id` int(12) NOT NULL,
  `participant` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `nation` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `price` varchar(6) COLLATE utf8mb4_unicode_ci NOT NULL,
  `banquet` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `hotel` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `type` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- テーブルのデータのダンプ `participant_table`
--

INSERT INTO `participant_table` (`id`, `participant`, `nation`, `price`, `banquet`, `hotel`, `type`, `date`, `created_at`, `updated_at`) VALUES
(1, '参加者', '国籍', '10000', '懇親会', 'ホテル', '部屋タイプ', '2021-06-04', '2021-06-03 13:03:43', '2021-06-03 13:03:43'),
(2, '参加', '日本', '20000', '懇親', 'ホテル', 'シングル', '2021-06-04', '2021-06-03 19:04:19', '2021-06-03 19:04:19'),
(3, '参加', '米国', '20000', '懇親', 'ホテル', 'シングル', '2021-06-06', '2021-06-03 19:05:15', '2021-06-03 19:05:15'),
(4, 'a', 'A', '123', 'A', 'A', 'A', '2021-06-06', '2021-06-03 19:36:36', '2021-06-03 19:36:36'),
(5, 'a', 'A', '123', 'A', 'A', 'A', '2021-06-06', '2021-06-03 19:37:15', '2021-06-03 19:37:15'),
(6, 'A', 'A', '1', 'A', 'A', 'あ', '2021-06-06', '2021-06-03 19:37:36', '2021-06-03 19:37:36'),
(7, 'ｓ', 'ｓ', '10', 'ｄ', 'あ', 'a', '2021-06-06', '2021-06-03 19:42:05', '2021-06-03 19:42:05'),
(8, 'マイク', 'イギリス', '1000', '参加', 'シーホーク', 'シングル', '2021-06-06', '2021-06-03 19:59:50', '2021-06-03 19:59:50'),
(9, 'ｗ', 'ｗ', '10000', 'お', 'ｋ', 'ｆ', '2021-06-06', '2021-06-03 20:22:58', '2021-06-03 20:22:58'),
(10, 's', 's', '11', 'f', 's', 's', '2021-06-06', '2021-06-03 22:27:52', '2021-06-03 22:27:52'),
(11, 'a', 'a', '11', 'wa', 'wa', 'wa', '2021-06-06', '2021-06-03 23:03:16', '2021-06-03 23:03:16'),
(12, 'a', 'a', '-3', 'f', 'e', 'w', '2021-06-06', '2021-06-03 23:03:38', '2021-06-03 23:03:38'),
(13, 'キム', '韓国', '15000', '参加', 'ANA', 'シングル', '2021-06-06', '2021-06-04 05:03:35', '2021-06-04 05:03:35'),
(14, 'ナンシー', 'アメリカ', '10000', '参加', 'オークラ', 'シングル', '2021-06-06', '2021-06-04 08:04:47', '2021-06-04 08:04:47'),
(15, 'ミッシェル', 'フランス', '20000', '参加', '日航', 'シングル', '2021-06-06', '2021-06-04 08:05:17', '2021-06-04 08:05:17'),
(16, 'ボルシチ', 'ロシア', '10000', '不参加', 'ANA', 'ダブル', '2021-06-06', '2021-06-04 08:05:50', '2021-06-04 08:05:50'),
(17, 'トムヤムクン', 'タイ', '10000', '不参加', 'オークラ', 'シングル', '2021-06-06', '2021-06-04 08:06:17', '2021-06-04 08:06:17'),
(18, 'フォー', 'ベトナム', '20000', '参加', 'オークラ', 'シングル', '2021-06-06', '2021-06-04 08:07:46', '2021-06-04 08:07:46'),
(19, 'パエリア', 'スペイン', '10000', '参加', 'ANA', 'シングル', '2021-06-06', '2021-06-04 08:08:21', '2021-06-04 08:08:21'),
(20, 'タコス', 'メキシコ', '10000', '参加', 'オークラ', 'シングル', '2021-06-06', '2021-06-04 08:09:25', '2021-06-04 08:09:25'),
(21, '佐々木', '日本', '10000', '参加', 'アパホテル', 'シングル', '2021-06-06', '2021-06-04 08:10:16', '2021-06-04 08:10:16'),
(22, 'ショウロンポウ', '台湾', '10000', '参加', '日航', 'シングル', '2021-06-06', '2021-06-04 08:11:34', '2021-06-04 08:11:34');

-- --------------------------------------------------------

--
-- テーブルの構造 `todo_table`
--

CREATE TABLE `todo_table` (
  `id` int(12) NOT NULL,
  `todo` varchar(128) COLLATE utf8mb4_unicode_ci NOT NULL,
  `deadline` date NOT NULL,
  `created_at` datetime NOT NULL,
  `updated_at` datetime NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- テーブルのデータのダンプ `todo_table`
--

INSERT INTO `todo_table` (`id`, `todo`, `deadline`, `created_at`, `updated_at`) VALUES
(1, '課題', '2021-06-01', '2021-06-01 12:26:26', '2021-06-01 12:26:26'),
(2, 'english', '2021-08-07', '2021-06-01 16:28:01', '2021-06-01 16:28:01'),
(3, 'english', '2021-08-27', '2021-06-01 16:28:06', '2021-06-01 16:28:06'),
(4, 'english', '2021-08-27', '2021-06-01 16:28:12', '2021-06-01 16:28:12'),
(5, 'english', '2021-08-27', '2021-06-01 16:45:31', '2021-06-01 16:45:31'),
(6, 'gsgsgs', '2021-09-30', '2021-06-01 16:45:44', '2021-06-01 16:45:44'),
(7, 'english', '2021-09-24', '2021-06-01 16:47:08', '2021-06-01 16:47:08'),
(8, 'sss', '2021-06-28', '2021-06-01 16:49:17', '2021-06-01 16:49:17'),
(9, 'sss', '2021-06-28', '2021-06-01 16:49:46', '2021-06-01 16:49:46'),
(10, 'english', '2021-06-28', '2021-06-01 16:52:41', '2021-06-01 16:52:41'),
(11, 'study', '2021-08-31', '2021-06-01 16:56:17', '2021-06-01 16:56:17'),
(12, 'english', '2022-01-31', '2021-06-01 16:56:29', '2021-06-01 16:56:29'),
(13, 'bd', '2021-06-01', '2021-06-01 17:04:59', '2021-06-01 17:04:59'),
(14, 'english', '2021-06-05', '2021-06-01 17:05:44', '2021-06-01 17:05:44'),
(15, 'english', '2021-06-04', '2021-06-01 17:15:33', '2021-06-01 17:15:33'),
(16, 'pro', '2021-06-03', '2021-06-03 10:44:26', '2021-06-03 10:44:26'),
(17, 'english', '2021-10-31', '2021-06-03 10:44:48', '2021-06-03 10:44:48'),
(18, 'sutdy', '2021-10-28', '2021-06-03 10:45:18', '2021-06-03 10:45:18'),
(19, 'kadai', '2021-06-04', '2021-06-03 10:47:42', '2021-06-03 10:47:42'),
(20, 'gsgsgs', '2021-06-28', '2021-06-03 11:08:57', '2021-06-03 11:08:57'),
(21, 'english', '2022-01-01', '2021-06-03 12:42:55', '2021-06-03 12:42:55'),
(22, 'ddd', '2021-06-03', '2021-06-03 17:55:00', '2021-06-03 17:55:00'),
(23, 'fff', '2021-06-05', '2021-06-03 17:55:14', '2021-06-03 17:55:14'),
(24, 'english', '2021-06-24', '2021-06-03 17:55:33', '2021-06-03 17:55:33'),
(25, 'english', '2021-02-01', '2021-06-03 23:05:09', '2021-06-03 23:05:09');

--
-- ダンプしたテーブルのインデックス
--

--
-- テーブルのインデックス `participant_table`
--
ALTER TABLE `participant_table`
  ADD PRIMARY KEY (`id`);

--
-- テーブルのインデックス `todo_table`
--
ALTER TABLE `todo_table`
  ADD PRIMARY KEY (`id`);

--
-- ダンプしたテーブルの AUTO_INCREMENT
--

--
-- テーブルの AUTO_INCREMENT `participant_table`
--
ALTER TABLE `participant_table`
  MODIFY `id` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=23;

--
-- テーブルの AUTO_INCREMENT `todo_table`
--
ALTER TABLE `todo_table`
  MODIFY `id` int(12) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
